// Задача 15: Напишите программу, которая принимает на вход цифру, 
// обозначающую день недели, и проверяет, является ли этот день выходным.
// 6 -> да
// 7 -> да
// 1 -> нет

Console.WriteLine("Введите число: ");
int number = Convert.ToInt32(Console.ReadLine());
if (number < 1 || number > 7)
{
    Console.WriteLine("Введено некорректное значение..."); // Вывод сообщения об ошибке
    Console.WriteLine("Введите число от 1 до 7");
}
else if (number == 6 || number == 7)
{
    Console.WriteLine("Выходной день!"); // Введенное число обозначает выходной
}
else
{
    Console.WriteLine("Рабочий день."); // Введенное число обозначает рабочий день.
}
